{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "Embedding", "config": {"dtype": "float32", "output_dim": 32, "activity_regularizer": null, "trainable": true, "embeddings_regularizer": null, "mask_zero": false, "embeddings_constraint": null, "name": "embedding_1", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "batch_input_shape": [null, 500], "input_dim": 5000, "input_length": 500}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "units": 1}}]}