{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "output_dim": 32, "input_length": 500, "embeddings_regularizer": null, "activity_regularizer": null, "mask_zero": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "batch_input_shape": [null, 500], "embeddings_constraint": null, "trainable": true, "input_dim": 5000, "dtype": "float32"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "units": 1, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "sigmoid"}}], "keras_version": "2.2.2"}